tutorials/pyrolysisOneDim/0/U
/*----------------------------------------------------------------------------*\
| **************       ******* | Automatically Generated FOAM File            |
| ****************   ********* |                                              |
|             *********** **** | URL: https://dev.azure.com/fmglobal/Research |
| ***********   *******   **** | Repo: fireFoam.newCaseConfiguration          |
| ***********     ****    **** | Commit: 4e942a4                              |
| ****                    **** | Created by: krismana                         |
| ****                    **** | Created on: 2024 Sep 02                      |
\*----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/";
    object      U;
}

dimensions		[0 1 -1 0 0 0 0];

internalField	uniform (0 0 0);

boundaryField
{
	"(top|sides)"
	{
		type	pressureInletOutletVelocity;
		value	$internalField;
		inletValue	$internalField;
	}

	"region0_to_.*"
	{
		type	noSlip;
	}

}
