tutorials/pyrolysisOneDim/0/fuelRegion/Y0Default
/*----------------------------------------------------------------------------*\
| **************       ******* | Automatically Generated FOAM File            |
| ****************   ********* |                                              |
|             *********** **** | URL: https://dev.azure.com/fmglobal/Research |
| ***********   *******   **** | Repo: fireFoam.newCaseConfiguration          |
| ***********     ****    **** | Commit: 4e942a4                              |
| ****                    **** | Created by: krismana                         |
| ****                    **** | Created on: 2024 Sep 02                      |
\*----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fuelRegion";
    object      Y0Default;
}

dimensions		[0 0 0 0 0 0 0];

internalField	uniform 0;

boundaryField
{
	".*"
	{
		type	zeroGradient;
	}

}
