tutorials/pyrolysisOneDim/0/nut
/*----------------------------------------------------------------------------*\
| **************       ******* | Automatically Generated FOAM File            |
| ****************   ********* |                                              |
|             *********** **** | URL: https://dev.azure.com/fmglobal/Research |
| ***********   *******   **** | Repo: fireFoam.newCaseConfiguration          |
| ***********     ****    **** | Commit: 4e942a4                              |
| ****                    **** | Created by: krismana                         |
| ****                    **** | Created on: 2024 Sep 02                      |
\*----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/";
    object      nut;
}

dimensions		[0 2 -1 0 0 0 0];

internalField	uniform 0;

boundaryField
{
	"(top|sides)"
	{
		type	zeroGradient;
	}

	"region0_to_.*"
	{
		type	fixedValue;
		value	$internalField;
	}

}
