tutorials/pyrolysisOneDim/Allrun.pre
#!/bin/bash

cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allclean
runApplication -s default blockMesh -dict system/blockMeshDict.default 

runApplication -s pyrolysis topoSet -dict system/topoSetDict.pyrolysis 

runApplication -s fuelRegion extrudeToRegionMesh -overwrite  -dict system/extrudeToRegionMeshDict.fuelRegion 

cp -f 0/ph_rgh.orig	0/ph_rgh

