tutorials/pyrolysisOneDim/constant/radiationProperties
/*----------------------------------------------------------------------------*\
| **************       ******* | Automatically Generated FOAM File            |
| ****************   ********* |                                              |
|             *********** **** | URL: https://dev.azure.com/fmglobal/Research |
| ***********   *******   **** | Repo: fireFoam.newCaseConfiguration          |
| ***********     ****    **** | Commit: 4e942a4                              |
| ****                    **** | Created by: krismana                         |
| ****                    **** | Created on: 2024 Sep 02                      |
\*----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/";
    object      radiationProperties;
}

radiation	no;
radiationModel	none;
noneCoeffs	{
		dummy	none;
	}
solverFreq	50;
absorptionEmissionModel	none;
scatterModel	none;
transmissivityModel	none;