tutorials/pyrolysisOneDim/system/fuelRegion/fvSolution
/*----------------------------------------------------------------------------*\
| **************       ******* | Automatically Generated FOAM File            |
| ****************   ********* |                                              |
|             *********** **** | URL: https://dev.azure.com/fmglobal/Research |
| ***********   *******   **** | Repo: fireFoam.newCaseConfiguration          |
| ***********     ****    **** | Commit: 4e942a4                              |
| ****                    **** | Created by: krismana                         |
| ****                    **** | Created on: 2024 Sep 02                      |
\*----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fuelRegion";
    object      fvSolution;
}

solvers
{
	h
	{
		solver	PCG;
		preconditioner	DIC;
		tolerance	1e-12;
		relTol	0;
	}

	"Yi"
	{
		solver	PBiCG;
		preconditioner	DILU;
		tolerance	1e-06;
		relTol	0;
	}

	"(rho|rhot|thermo:rho)"
	{
		solver	PCG;
		preconditioner	DIC;
		tolerance	0;
		relTol	0;
	}

}

SIMPLE
{
	nNonOrthCorr	0;
}

