tutorials/pyrolysisOneDim/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss filteredLinear2V 0.2 0.05;//Gauss LUST grad(U);

    div(phi,k)      Gauss limitedLinear 1;
    div(phi,K)      Gauss limitedLinear 1;
    flux(phi,O2)    Gauss limitedLinear01 1;
    flux(phi,CH4)   Gauss limitedLinear01 1;
    flux(phi,H2O)   Gauss limitedLinear01 1;
    flux(phi,CO2)   Gauss limitedLinear01 1;
    flux(phi,hs)    Gauss limitedLinear 1;
    div(phi,hs)     Gauss limitedLinear 1;

    div(phi,Yi_h) Gauss multivariateSelection
    {
        O2              limitedLinear01 1;
        N2              limitedLinear01 1;
        CH4             limitedLinear01 1;
        C3H8            limitedLinear01 1;
        CORRUGATED      limitedLinear01 1;
        CH2O            limitedLinear01 1;
        H2O             limitedLinear01 1;
        CO2             limitedLinear01 1;
        h               limitedLinear 1;
    };

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;

    div(phiU,p)     Gauss linear;

    div(Ji,Ii_h)    Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;//uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;//uncorrected;
}


// ************************************************************************* //